#include <string>
#include <vector>
#include <iostream>
#include <random>

using std::cout;
using std::endl;
using std::string;
using std::vector;

int main()
{
  vector<string> words = {"春天", "姑娘", "仔细", "野花", "柳枝", "秋千", "桃花", "杏花",
                          "鲜花", "邮递员", "先生", "原来", "大叔", "邮局", "太太", "做客", "惊奇", "快活", "美好", "礼物",
                          "爷爷", "植树", "碧空如洗", "万里无云", "公园", "格外", "引人注目", "已经", "汗珠", "休息", "树苗", "小心", "笔直",
                          "叔叔", "足迹", "昨天", "迷路", "温暖", "春风", "爱心",
                          "也许", "桌子", "平时", "难道", "味道", "就是", "农民", "加工", "种子", "农具", "甜菜", "工具", "劳动", "经过",
                          "出色", "妹妹", "河水", "碧绿", "波纹", "河岸", "柳叶", "非常", "景色", "恋恋不舍", "柳树", "枝条", "高兴",
                          "神州", "中华", "山川", "黄河", "长江", "长城", "台湾岛", "海峡", "民族", "情谊", "奋发",
                          "节日", "春节", "花灯", "清明节", "先人", "龙舟", "中秋", "转眼", "团圆", "热闹",
                          "动物", "贝壳", "自己", "身体", "甲骨文", "样子", "可以", "钱币", "钱财", "有关", "比如",
                          "美食", "红烧", "茄子", "烤鸭", "羊肉", "蛋炒饭",
                          "彩色", "脚尖", "森林", "雪松", "歌声", "苹果", "精灵", "季节",
                          "好像", "一直", "说话", "童话", "称呼", "对岸", "发现", "弟弟", "游戏", "发明", "字母",
                          "周围", "补充", "公主", "伙伴", "飞机", "地道", "火药", "合力", "忘记",
                          "屁股", "苍耳", "留神", "只是", "干净", "从来", "幸运", "快乐", "使劲", "夜晚", "听见", "草地",
                          "亡羊补牢", "劝告", "禾苗", "筋疲力尽", "明白",
                          "图画", "老师", "讲课", "同学", "座位", "教室", "哈哈大笑", "五角星", "然后", "画纸", "神情", "角度",
                          "愿意", "麦子", "为难", "四周", "伯伯", "立刻", "突然", "吃惊", "认真", "脚步", "难为情",
                          "雷雨", "乌云", "闪电", "雷声", "房子", "窗户", "清新", "迎面",
                          "野外", "大自然", "天然", "指南针", "帮助", "方向", "向导", "指点", "北极星", "永远", "黑夜", "帮忙", "特别", "积雪",
                          "太空", "生活", "别处", "活动", "主要", "方便", "杯子", "喝水", "使用", "洗澡", "容易", "浴桶",
                          "大象", "耳朵", "扇子", "遇到", "兔子", "毛病", "后来", "不安", "头痛", "最后", "人家",
                          "决定", "商店", "工夫", "终于", "围巾", "星期",
                          "青蛙", "草籽", "野鸭", "泉水", "竹子", "应该", "花丛", "尽情", "道路",
                          "毛虫", "叶子", "目光", "周游", "纺织", "编织", "怎样", "声音", "色彩", "花纹", "消失",
                          "祖先", "原始", "意思", "浓绿", "一望无边", "蓝天", "野果", "野兔", "赛跑", "回忆",
                          "世界", "学习", "成功", "月亮", "主意", "反反复复", "变化", "方式", "简单", "自由", "生长", "相当", "结局", "开头",
                          "光明", "觉得", "值日", "人类", "艰难", "决心", "苦海", "炎热", "害怕", "从此", "花草树木", "生机"};
  vector<string> errorWords = {"幸运"};

  int count = 0;
  srand(time(0));
  while (count < 10)
  {
    int randomPosition = rand() % words.size();
    string word = words[randomPosition];
    if (find(errorWords.cbegin(), errorWords.cend(), word) == errorWords.cend())
    {
      errorWords.push_back(word);
      ++count;
    }
  }
  cout << "The words for test are: " << endl;
  for_each(errorWords.begin(), errorWords.end(), [](string &s)
           { cout << s << endl; });

  return 0;
}